Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to his feet, stood before him, and, with his hands placed together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ནས།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཤད་དུ་གསོལ།
en: Explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཡོངས་སུ་མི་ཟད་པ་ཐོབ་པ་སྟེ།
en: Veṣṭhila said, “Noble one, I have attained the bodhisattva liberation called the attainment of the summit of inexhaustibility

source: རིགས་ཀྱི་བུ་ཁོ་བོའི་སེམས་ཀྱི་རྒྱུད་ལས་ནི། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ནས་ཀྱང་། སེམས་ཅན་འདུལ་བའི་དབང་དུ་མཛད་པ་མ་གཏོགས་པར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ནས་ཀྱང་ཤིན་ཏུ་མྱ་ངན་ལས་འདས་པའི་ཚུལ་དུ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མེད་དོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མེད་དོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་མེད་དོ།
en: “Noble one, from my mind’s viewpoint, a tathāgata has not passed into nirvāṇa, does not pass into nirvāṇa, and will not pass into nirvāṇa in any world other than as a way to bring beings who are to be guided under his control, not as a way to enter truly complete nirvāṇa.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཙན་དན་གྱི་ཁྲི་འཕང་གི་སྒོ་འབྱེད་པ་སྟེ། ཁོ་བོ་མཆོད་རྟེན་གྱི་སྒོ་འབྱེད་འབྱེད་པས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་རིགས་མི་ཟད་པའི་རྒྱན་ཅེས་བྱ་བ་ཐོབ་བོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་ཏིང་ངེ་འཛིན་འདི་ཉིད་ལ་སེམས་ཀྱི་སྐད་ཅིག་སྐད་ཅིག་ཏུ་མཉམ་པར་གཞོག་སྟེ།
en: “Noble one, in that way, when I opened the door of the sandalwood-throne shrine of the Tathāgata, I attained, by opening the door of the shrine, the bodhisattva samādhi called the display of the unceasing family of the buddhas

source: སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་ལའང་ཁྱད་པར་གྱི་རྣམ་པ་དུ་མ་རབ་ཏུ་འཐོབ་བོ། །སྨྲས་པ།
en: “Noble one, in each instant of mind I rest in this samādhi, and I attain many special features

source: འཕགས་པ་ཏིང་ངེ་འཛིན་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked, “Ārya, what is the scope of that samādhi?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོ་ཏིང་ངེ་འཛིན་འདི་ལ་སྙོམས་པར་ཞུགས་པའི་ཚེ།
en: Veṣṭhila replied, “Noble one, when I am resting in this samādhi, there appear to me all the tathāgatas, such as Kāśyapa, in a continuous succession of one buddha after another within the lineage of this world:

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འདི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པོ་བསོད་སྐྱབས་ལ་སྩོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་། གསེར་ཐུབ་དང་། ལོག་པར་དད་སེལ་དང་། ཐམས་ཅད་མངའ་བ་དང་། གཙུག་ཏོར་ཅན་དང་། རྣམ་པར་གཟིགས་དང་། རྒྱལ་དང་། རྫོགས་མཛད་དང་། གྲགས་མཆོག་དང་། པད་མོའི་བླ་ལ་སྩོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་མཐོང་བའི་མཚམས་འབྲེལ་པས།
en: all the tathāgatas such as Kanaka­muni, Krakucchanda, Viśvabhuk, Śikhin, Vipaśyin, Tiṣya, Puṣya, Yaśottara, and Padmottara.

source: སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྒྱུན་མི་འཆད་པའི་ཚུལ་གྱིས་མངོན་སུམ་དུ་མཐོང་སྟེ། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་བརྒྱ་ཡང་མཐོང་ངོ་།
en: I see in the consecutive appearances of the buddhas the unceasing succession of one buddha after another, a hundred buddhas in one instant of mind.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་སྟོང་ཡང་མཐོང་ངོ་།
en: In the next instant of mind I perceive a thousand buddhas.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་སྟོང་ཡང་མཐོང་ངོ་།
en: In the next instant of mind I perceive a hundred thousand buddhas.

source: །དེ་བཞིན་དུ་སངས་རྒྱས་བྱེ་བ་དང་། སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དང་། སངས་རྒྱས་བྱེ་བ་དུང་ཕྱུར་དང་། སངས་རྒྱས་བྱེ་བ་ཐམས་ཅད་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དང་། དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་འབྱུང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: In the same way I see ten million buddhas, a thousand million buddhas, ten thousand million buddhas, a million million buddhas, ten million billion buddhas, ten million million billion buddhas, a hundred thousand million billion buddhas, and ten million million billion buddhas, and so on, until in a subsequent moment of mind I perceive an inexpressible number of inexpressible numbers of buddhas appearing in succession.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་ངོ་།
en: In the next instant of mind I see tathāgatas as numerous as the atoms in Jambudvīpa.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་སྟེ།
en: In the next instant of mind I see tathāgatas as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms. “I also perceive the successive accumulations for the first development of the aspiration to enlightenment by those tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐུགས་དང་པོ་བསྐྱེད་པའི་ཚོགས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་འཇུག་གོ ཐུགས་དང་པོ་བསྐྱེད་པས་འཐོབ་པའི་རྣམ་པར་འཕྲུལ་པ་ལའང་འཇུག་གོ །སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་མངོན་པར་བསྒྲུབས་པ་རྣམ་པར་དག་པ་ལ་འང་འཇུག་གོ །སྤྱོད་པ་རྣམ་པར་དག་པ་ལའང་འཇུག་གོ །ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་ལའང་འཇུག་གོ །བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབས་པ་ལ་འང་འཇུག་གོ །བཟོད་པ་བརྙེས་པ་རྣམ་པར་དག་པ་ལའང་འཇུག་གོ །བདུད་ཀྱི་དཀྲུགས་མ་རྣམ་པར་འཐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ལའང་འཇུག་གོ །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ལའང་འཇུག་གོ །སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པར་མཛད་པ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །འཁོར་ཀུན་ནས་འདུས་པ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །འོད་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ལའང་འཇུག་གོ །སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ལའང་འཇུག་གོ །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཆོས་བསྟན་པ་ཡང་ཤིན་ཏུ་རྣམ་པར་གསལ་བ་དང་། མ་འདྲེས་པར་དྲན་ཏེ།
en: I perceive the miraculous powers they attain through their first development of the aspiration to enlightenment. I perceive their pure fulfillment of their different prayers. I perceive their pure conduct. I perceive their complete accomplishment of the perfections. I perceive their attainment of all the bodhisattva bhūmis. I perceive their pure attainment of patience. I perceive their roaring that disperses the disturbances of the māras. I perceive the display of the miracles of their complete buddhahood. I perceive the purification of their different buddha realms. I perceive their different ripening of beings. I perceive their different gatherings of followers. I perceive their different halos of light. I perceive their supremacy in turning the wheel of the Dharma. I perceive their attainment of the miraculous powers, miracles, and miraculous manifestations of buddhahood.

source: ཡང་དག་པར་འཛིན་ཏོ།
en: “I remember and keep the Dharma teachings of these tathāgatas clearly and distinctly.

source: །དྲན་པས་ཡོངས་སུ་བཅངས་སོ།
en: Through my memory I possess them.

source: །རིག་པས་རབ་ཏུ་ཤེས་པར་བྱེད་དོ།
en: With my intelligence I understand them.

source: །བློ་གྲོས་ཀྱིས་ཤིན་ཏུ་རྣམ་པར་འབྱེད་དོ།
en: With reverence I distinguish among them.

source: །བློས་རྟོགས་པར་བྱེད་དོ།
en: With my intellect I comprehend them.

source: །ཤེས་རབ་ཀྱིས་སྣང་བར་བྱེད་དོ།
en: With my wisdom I illuminate them.

source: །མ་བྱོན་པའི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་བྱམས་པ་ལ་སྩོགས་པ་དག་ཀྱང་མཐོང་ཞིང་ཤེས་ཏེ།
en: “I also see and know the future succession of buddhas, such as Maitreya.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་བརྒྱ་ཡང་མཐོང་ངོ་།
en: I see a hundred buddhas in one instant of mind.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་སྟོང་ཡང་མཐོང་བ་ནས། དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཀྱང་མཐོང་སྟེ།
en: In the next instant of mind I perceive a thousand buddhas, and so on, up to the instant of mind in which I see tathāgatas as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms. “I also perceive the successive accumulations for the first development of the aspiration to enlightenment by those tathāgatas. I perceive the miraculous powers they attain through their first development of the aspiration to enlightenment. I perceive their pure fulfillment of their different prayers. I perceive their pure conduct. I perceive their complete accomplishment of the perfections. I perceive their attainment of all the bodhisattva bhūmis. I perceive their pure attainment of patience. I perceive their roaring that disperses the disturbances of the māras. I perceive the display of the miracles of their complete buddhahood. I perceive the purification of their different buddha realms. I perceive their different ripening of beings. I perceive their different gatherings of followers. I perceive their different halos of light. I perceive their supremacy in turning the wheel of the Dharma. I perceive their attainment of the miraculous powers, miracles, and miraculous manifestations of buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐུགས་དང་པོ་བསྐྱེད་པའི་ཚོགས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་འཇུག་གོ །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཆོས་བསྟན་པ་ཡང་ཤིན་ཏུ་གསལ་བ་དང་། མ་འདྲེས་པར་རྗེས་སུ་དྲན་ཏེ་ཡང་དག་པར་འཛིན་ཏོ།
en: “I remember and keep the Dharma teachings of these tathāgatas clearly and distinctly.

source: །བློ་གྲོས་ཀྱིས་རྣམ་པར་འབྱེད་དོ།
en: With reverence I distinguish among them.

source: །ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འདི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐར་གཏོགས་པའི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་མཐོང་ཞིང་ཤེས་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འདས་པ་དང་། མ་འོངས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱང་ཤེས་ཤིང་མཐོང་ངོ་།
en: “Just as I see and know the succession of buddhas in the past and in the future in the lineage of this world realm, I see and know in the lineage of world realms in the ten directions as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms the succession of tathāgatas in the past and in the future. “I also perceive the successive accumulations for the first development of the aspiration to enlightenment by those tathāgatas, and so on. “I know and comprehend the unbroken, unceasing succession of the buddhas.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐུགས་དང་པོ་བསྐྱེད་པའི་ཚོགས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་འཇུག་གོ །སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་ལའང་རྒྱུན་མི་འཆད་པ་དང་། མི་ཟད་པ་དང་། དད་པས་ཤེས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་དང་། ཞོ་ནོན་པས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱེད་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། དེའི་ཡུལ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: It is unequaled; it is known through faith, is known through the diligence and resolve of bodhisattvas, augments the power of the diligence of bodhisattvas, and cannot be overcome by the entire world, by all śrāvakas and pratyeka­buddhas, or by bodhisattvas who have not entered its scope.

source: །རྣམ་པར་སྣང་མཛད་ལ་སྩོགས་པ་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱང་མཐོང་ཞིང་ཤེས་ཏེ།
en: “I see and know the succession of the present tathāgatas that reside in world realms in the ten directions, such as Vairocana.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་བརྒྱ་ཡང་མཐོང་ཞིང་ཤེས་སོ།
en: “I see a hundred buddhas in one instant of mind.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་སྟོང་ཡང་མཐོང་བ་ནས། དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་དུ་ཡང་མཐོང་སྟེ།
en: In the next instant of mind I perceive a thousand buddhas, and so on, up to the instant of mind in which I see tathāgatas as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms.

source: ནམ་དེ་བཞིན་གཤེགས་པ་གང་གི་ཞལ་བལྟ་བར་དགའ་བ་དེའི་ཚེ་འང་དེ་བཞིན་དུ་མཐོང་སྟེ།
en: “When I wish to see a certain tathāgata, I see him.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བསྟན་པ་དང་། བསྟན་པ་མཛད་པ་དང་། བསྟན་པར་འགྱུར་བ་དེ་དག་ཀྱང་ཐོས་སོ།
en: I hear all that has been taught, is being taught, and will be taught by those buddhas, those bhagavats.

source: །ཐོས་ནས་ཀྱང་འཛིན་ཏོ།
en: When I have heard them, I retain them.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བའི་མཐར་ཕྱིན་པ་འདི་ཤེས་བར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་སྐད་ཅིག་གཅིག་ཏུ་ཤེས་པ་རབ་ཏུ་ཐོབ་པ།
en: “Noble one, I know this bodhisattva liberation called the attainment of the summit of inexhaustibility , but how could I know the conduct or describe the qualities of the bodhisattvas who know the three times in a single instant;

source: སྐད་ཅིག་གཅིག་གི་ཆ་ཤས་ལ་ཏིང་ངེ་འཛིན་རྣམ་པར་ཕྱེ་བ་ལ་སྤྱད་པ།
en: who in one fraction of an instant of their practice dwell in an array of samādhis;

source: དེ་བཞིན་གཤེགས་པའི་ཉི་མ་ལས་བྱུང་བ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ།
en: who have entered into the sunlight of the tathāgatas; who understand the equality of all concepts and misconceptions;

source: སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པའི་ཏིང་ངེ་འཛིན་རྗེས་སུ་རྟོགས་པ།
en: who have realized the samādhi that is equal to that of all the buddhas;

source: བདག་དང་སེམས་ཅན་དང་། སངས་རྒྱས་མི་གཉིས་པར་སྤྱོད་པ།
en: who act in the nonduality of self, beings, and buddhas;

source: རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཆོས་ཀྱི་རྒྱན་གྱི་དཀྱིལ་འཁོར་དང་ལྡན་པ།
en: who are in the domain of the display of the Dharma of natural luminosity;

source: ཡེ་ཤེས་ཀྱི་འཁྲུལ་འཁོར་ཀྱིས་འཇིག་རྟེན་གྱི་དྲ་བ་འགེངས་པ།
en: who have cut through the net of the world with the device of wisdom;

source: དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ཐམས་ཅད་དང་། མི་འགལ་བར་རྣམ་པར་སྤྱོད་པ།
en: who act without disturbing the seal of the Dharma of the tathāgatas;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྣམ་པར་རྟོགས་པར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པ།
en: who have the scope of wisdom that understands the entire realm of phenomena;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་རྣམ་པར་རིག་པར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ཅན་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: who have the scope of wisdom that understands the Dharma teaching of all the tathāgatas? “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་རི་གྲུ་འཛིན་ཅེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, there is the mountain named Potalaka.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells the bodhisattva by the name of Avalokiteśvara.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དྲིས་ཤིག་ཅེས་ནས་དེའི་ཚེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: ཚིགས་སུ་བཅད་པ་འདི་གཉིས་སྨྲས་སོ།
en: Then he spoke these two verses: “Depart, Sudhana!

source: །སོང་ཤིག་ནོར་བཟངས་དཔལ་གྱི་ཆུ་རྒྱལ་དཔུང་ཞིག་ན།
en: In the center of the glorious king of the waters

source: །མཁས་པ་རྣམས་ཀྱིས་རི་རྒྱལ་གྲུ་འཛིན་མཛེས་པ་ཡོད།
en: Is beautiful Potalaka, king of mountains, the residence of heroes.

source: །རིན་ཆེན་རྒྱུས་བྱས་ཤིང་དང་ནགས་ཚལ་མེ་ཏོག་མང་།
en: It has excellent trees made of jewels, is covered with flowers,

source: །བཟའ་ཤིང་ར་བ་རྫིང་དང་ཆུ་བྲན་འབབ་པར་ལྡན།
en: And is endowed with parks, lotus ponds, and flowing streams. “Wise Avalokiteśvara who benefits beings—

source: །རི་མཆོག་དེ་ལ་བརྟན་པར་སྤྱན་རས་གཟིགས་ཀྱི་དབང་། །འགྲོ་བ་རྣམས་ལ་ཕན་པའི་དོན་དུ་རྣམ་པར་སྤྱོད།
en: That resolute one dwells on that supreme mountain.

source: །དེའི་གན་སོང་དང་ནོར་བཟངས་ཁྱོད་ལ་མགོན་པོ་ཡིས།
en: Go to him, Sudhana, and you will be taught

source: །ཡོན་ཏན་རྒྱ་ཆེན་ཚུལ་ལ་འཇུག་པ་སྟོན་པར་བྱེད།
en: The qualities of the Guides, the entry into the way of vast goodness.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཁྱིམ་བདག་ནན་ཁུགས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the householder Veṣṭhila, circumambulated the householder Veṣṭhila many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the householder Veṣṭhila.

source: བམ་པོ་ལྔ་པ།
en: Avalokiteśvara

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་གདམས་ངག་རྗེས་སུ་སེམས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའི་མོས་པའི་མཛོད་དེ་ནི་ཤེས་པར་བྱེད། བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་དྲན་པའི་སྟོབས་དེ་ནི་རྗེས་སུ་དྲན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཚུལ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་སྟོབས་ནི་ཡང་དག་པར་འཛིན། སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་མཚམས་ནི་ཁོང་དུ་ཆུད་པར་བྱེད། རྣས་ཐོས་པའི་སངས་རྒྱས་ཀྱི་མཚན་དེ་དག་གི་རྗེས་སུ་ནི་འབྲང་། སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པའི་ཚུལ་དེ་དང་ནི་འཐུན་པར་བྱེད། སངས་རྒྱས་ཀྱིས་ཡང་དག་པར་བསྒྲུབ་པའི་རྒྱན་དེ་ནི་ཁོང་དུ་ཆུད་པར་བྱེད། སངས་རྒྱས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དེ་ལ་ནི་ཡིད་ཆེས་པར་བྱེད། དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ནི་མངོན་དུ་བྱེད་ཅིང་།
en: Then Sudhana, the head merchant’s son, contemplating the instruction of the householder Veṣṭhila, knowing that treasury of bodhisattva aspiration, remembering that power of bodhisattva memory, keeping in his mind the power of that successive lineage of the way of the buddhas, comprehending the continuous succession of the lineage of the buddhas, remembering the names of the buddhas that he had heard, being in accord with the way of the Dharma taught by the buddhas, comprehending the array of attainments through the Dharma of the buddhas, having confidence in the proclamation of complete buddhahood by the buddhas, and focused on the inconceivable activity of the tathāgatas, eventually came to the Potalaka Mountain.

source: མཐར་གྱིས་རི་གྲུ་འཛིན་གང་ན་བ་དེར་སོང་ནས། རི་གྲུ་འཛིན་གྱི་སྟེང་དུ་ཕྱིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས།
en: He ascended the Potalaka Mountain and searched and searched for the bodhisattva Avalokiteśvara.

source: ནུབ་ཕྱོགས་ལོགས་ཀྱི་རིའི་སྨན་ལྗོངས་མཚོ་དང་། མཚེའུ་དང་འབབ་ཆུས་མཛེས་པར་གྱུར་པ། བཻཌཱུརྱ་སྔོན་པོའི་དཀྱིལ་འཁོར་ལྟར་སྔོ་ཞིང་འཇམ་ལ་གཞོན་པའི་སྤང་། ནགས་ཚལ་ཆེན་པོའི་མཐོངས་ན་འདུག་པ་ཞིག་ན།
en: He saw Avalokiteśvara on the upper slope of the western side of the mountain. It was a fresh, gentle, verdant pasture like a circular area of blue beryl and was beautified by springs, waterfalls, and streams, an open grove within a great forest.

source: རིན་པོ་ཆེའི་རྡོ་རྗེའི་རྡོ་སྟེགསཤིག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ཅིང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྡོ་སྟེགས་ལ་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དཔག་ཏུ་མེད་པས། ཀུན་ནས་བསྐོར་ཅིང་ཆོས་སྟོན་ཏེ།
en: He was teaching the Dharma, seated cross-legged upon a diamond rock encircled by a countless assembly of bodhisattvas seated upon rocks that were various jewels.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པའི་ཡུལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྒོ་གསལ་བར་སྟོན་པ་ཞེས་བ་བ་ཡང་དག་པར་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: He was giving the Dharma teaching called The Clear Teaching of the Gateway to Love and Compassion , which has as its scope the gathering of all beings into the Dharma.

source: །མཐོང་ནས་ཀྱང་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་དགའ་བས་རྒྱས་ཞིང་མི་འཛུམ་པའི་མིག་གིས་ཐལ་མོ་སྦྱར་ནས།
en: On seeing him, Sudhana was filled with joy, delighted, elated, pleased, and happy. With increasing rapture, he kept his eyes wide open. He placed his hands together in homage.

source: དགེ་བའི་བཤེས་གཉེན་ལ་དད་པའི་ཤུགས་དང་ལྡན་པས་སེམས་མི་འཁྲུག་པ།
en: His mind was at peace through being endowed with the power of faith in kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་མཐོང་ན། སངས་རྒྱས་ཐམས་ཅད་མཐོང་བར་འཛིན་པ།
en: He believed that to see kalyāṇamitras was to see all the buddhas.

source: དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའི་ཆོས་ཀྱི་སྤྲིན་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the acquisition of the entire cloud of Dharma originated from the kalyāṇamitras.

source: ཡོན་ཏན་དང་ནན་ཏན་ཐམས་ཅད་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལུས་པའི་འདུ་ཤེས་ཅན།
en: He believed that all qualities and practices depended on the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པ་ཤིན་ཏུ་དཀའ་བར་སེམས་པ།
en: He believed that it was difficult to encounter kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ལས་སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པ་ཆེ་འབྱུང་ཞིང་ཐོབ་པར་འགྱུར་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the attainment of the precious wisdom of the ten strengths came from the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ལས་སྣང་བ་མི་ཟད་པ་འབྱུང་བའི་འདུ་ཤེས་ཅན།
en: He believed that the inexhaustible light of wisdom came from the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་རྟེན་གྱི་བསོད་ནམས་ཀྱི་རྒྱུད་རྣམ་པར་འཕེལ་བར་འགྱུར་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the continuous increase of merit was dependent on the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྒོ་ཡང་དག་པར་སྟོན་པའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the gateway to omniscience was revealed by the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ལ་འཇུག་པའི་ཡོངས་སུ་སྟོན་པར་འདུ་ཤེས་པ།
en: He believed that entry into the great ocean of wisdom was taught by the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཡང་དག་པར་འདུས་པ། ཡོངས་སུ་བསྐྱེད་པའི་འདུ་ཤེས་དང་ལྡན་པ་དེ།
en: He believed that the gathering of the accumulation of omniscience was born from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་གང་ན་བ་དེར་ཕྱིན་ཏོ།
en: He went toward the bodhisattva Avalokiteśvara.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རིང་ཞིག་ནས་ཚུར་འོང་བ་མཐོང་ནས། སྨྲས་པ།
en: The bodhisattva Avalokiteśvara could see Sudhana, the head merchant’s son, coming in the distance and said, “Come here!

source: ཚུར་ཤོག་དཔེ་མེད་པའི་ཐེག་པ་ཆེན་པོ་ཡངས་ཤིང་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཞུགས་པ།
en: You are welcome, you who have entered the inconceivable, vast Mahāyāna, which is beyond any analogy;

source: སྐྱེ་བ་ལས་བྱུང་བའི་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱིས་གཙེས་ཤིང་སྐྱབས་མེད་པར་གྱུར་པའི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་བསམ་པ་དང་ལྡན་པ།
en: you who have the motivation to be a refuge for all beings who are tormented by various sufferings that arise through being born and who have no refuge;

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པ། འཇིག་རྟེན་ཐམས་ཅད་ལས་འདས་ཏེ་དཔེ་མེད་ཚད་མེད་པ་ལ་མངོན་པར་མོས་པ།
en: you who wish to witness all the Dharmas of the buddhas, which transcend the world, are beyond analogy, and are beyond measure;

source: སྙིང་རྗེ་ཆེན་པོས་བྱིན་གྱིས་བརླབས་པས། འགྲོ་བ་ཐམས་ཅད་ཡོངས་ས་བསྐྱབ་པའི་བློ་གྲོས་ཅན།
en: you who are filled with the power of great compassion and intend to liberate all beings;

source: བལྟ་ན་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་མངོན་དུ་བལྟས་པ།
en: you in whom the completely good conduct is evidently seen;

source: སྨོན་ལམ་ཆེན་པོའི་དཀྱིལ་འཁོར་ཡོངས་སུ་སྦྱང་བའི་སེམས་དང་ལྡན་པ།
en: you who aspire to make pure a domain of great prayers;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་བར་མོས་པ།
en: you who wish to possess the clouds of Dharma of all the buddhas;

source: དགེ་བའི་རྩ་བ་བསྩགས་པས་ངོམས་མི་ཤེས་པའི་བསམ་པ་དང་ལྡན་པ།
en: you whose motivation to accumulate roots of merit is never satisfied;

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ཡང་དག་པར་ཞུགས་པ།
en: you who follow perfectly the instructions of kalyāṇamitras;
